---
type: ConnectorManager
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ConnectorManager

`Autodesk.Revit.DB.ConnectorManager` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Lookup | 2016 | `public Connector Lookup ( int index )` |
| Property | Connectors | — | `public ConnectorSet Connectors { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Owner | — | `public Element Owner { get ; }` |
| Property | UnusedConnectors | — | `public ConnectorSet UnusedConnectors { get ; }` |